DERS1/performance/post.yml
config:
  target: "http://httpbin.org/"
  phases:
    - duration: 1
      arrivalRate: 1
      name: Goit Performance Test  # opsiyonel
  plugins:
    ensure:
      thresholds:
        - http.response_time.max: 3000
        - http.response_time.2xx.p99: 3000
      conditions:
        - expression: http.responses == 1
        - expression: vusers.failed == 1
        - expression: http.response_time.max <1000 and http.response_time.2xx.p95 <500
      
scenarios:
  - name: Create Account
    flow:
      - post:
          url: "{{ target }}post"
          json:
            username: "Goit"
            password: "12345"
          headers:
            Content-Type: "application/json"
          capture:
            - json: "$.json"
              as: "response_body"
            - json: "$.headers.Host"
              as: "host"
      - log: "Response Body : {{response_body}}"
      - log: "Host: {{host}}"